{
    "Game Title": "Flesh Machine",
    "Game Engine": "Unity",
    "Game Type": "2D",
    "Genre": "2D, Point-and-Click, Puzzle/Mystery, Analog Horror, Sci-fi",
    "Short Description": "Flesh Machine is a psychological horror game where you are invited to a research facility. Your role? Unclear, maybe a new researcher. You arrive to find the facility abandoned. The facility was mysteriously shut down overnight, leaving behind empty tanks, broken containment units, and the -organic- remnants of experiments that were never completed.\n\nThen, the intercom crackles to life. A voice—distorted, almost human—begs for your help. It is the last experiment, the final specimen. One that is alive. And it wants to be completed. This half-formed being begs you to help it complete its transformation.\n\nAs you search for answers to uncover what happened to the research facility, you solve puzzles to collect VHS tapes left behind by the scientists, each revealing fragments of the truth (like Vesscura, each puzzle yields one VHS tape. The whole truth/video is revealed after all VHS tapes are collected).\n\nInstead of having the whole escape-and-face-the-entity mechanics like in Vesscura, this game takes a simpler approach for its ending. The player simply has to make an ethical choice. A lot like “How Fish is Made.” So the horror comes not from survival mechanics, but from the weight or implications of the decision itself.\n\nAfter uncovering the truth, the player has to make a final choice:\n\nA. Help the creature evolve into its final form.\nB. Destroy it.\nC. Leave it incomplete, suffering in its unfinished state.\n\nI think the sweet spot of this concept would be in the designs, atmosphere, sheer horror, and moral implications, rather than complex game mechanics. This should be the type of game to linger in the player’s mind long after they finish, leaving them with something to think about. It has to be messed up.",
    "Inspiration / References": "How Fish Is Made, I Have no Mouth and I Must Scream, All Tomorrows, The Mandela Catalogue, Splice",
    "Team Size / Members": "Discussed in previous proposal. ",
    "Desired Roles": "Game Designers, Sound Designers",
    "Projected Difficulty": "Beginner-intermediate ",
    "Mentor": "Saleh Alghannam"
  }
  